In [ ]:
import pandas as pd
import config
from tqdm import tqdm_notebook

def sql_update(query):
    cursor = config.cursor
    # Execute Statment
    query = (query)
    try:
        cursor.execute(query)
    except Exception as ex:
        if str(ex) == 'ORA-00955: name is already used by an existing object':
            print ('Table Already Created...')
            pass
        else:
            print (ex)
            
query = ['drop table Movie',
         'drop table Reviewer',
         'drop table Rating']
for i in query:
    sql_update(i)

#### The Company has started a new movie-rating website and collected data on reviewers rating of different movies

Movie (mID, title, year, director)

Reviewer (rID, name)

Rating (rID, mID, stars, ratingDate)

The reviewer rID gave the movie mID a numver of stars rating (1-5) on a certain ratingDate

In [ ]:
#create table Movie(mID int, title text, year int, director text);
#create table Reviewer(rID int, name text);
#create table Rating(rID int, mID int, stars int, ratingDate date);

query = [
         'create table Movie(mID int primary key, title varchar2(30), year date, director varchar2(30))',
         'create table Reviewer(rID int primary key, name varchar2(30))',
         'create table Rating(rID int, mID int, stars int, ratingDate date)'
        ]
for i in query:
    try:
        sql_update(i)
    except:
        print (i)

In [ ]:
query = [
"insert into Movie values(101, 'Gone with the Wind', TO_DATE('1999','YYYY'), 'Victor Fleming')",
"insert into Movie values(102, 'Star Wars', TO_DATE('1977','YYYY'), 'George Lucas')",
"insert into Movie values(103, 'The Sound of Music', TO_DATE('1965','YYYY'), 'Robert Wise')",
"insert into Movie values(104, 'E.T.', TO_DATE('1982','YYYY'), 'Steven Spielberg')",
"insert into Movie values(105, 'Titanic', TO_DATE('1997','YYYY'), 'James Cameron')",
"insert into Movie values(106, 'Snow White', TO_DATE('1937','YYYY'), null)",
"insert into Movie values(107, 'Avatar', TO_DATE('2009','YYYY'), 'James Cameron')",
"insert into Movie values(108, 'Raiders of the Lost Ark', TO_DATE('1981','YYYY'), 'Steven Spielberg')",
"insert into Reviewer values(201, 'Sarah Martinez')",
"insert into Reviewer values(202, 'Daniel Lewis')",
"insert into Reviewer values(203, 'Brittany Harris')",
"insert into Reviewer values(204, 'Mike Anderson')",
"insert into Reviewer values(205, 'Chris Jackson')",
"insert into Reviewer values(206, 'Elizabeth Thomas')",
"insert into Reviewer values(207, 'James Cameron')",
"insert into Reviewer values(208, 'Ashley White')",
"insert into Rating values(201, 101, 2, TO_DATE('2011-01-22', 'YYYY-MM-DD'))",
"insert into Rating values(201, 101, 4, TO_DATE('2011-01-27', 'YYYY-MM-DD'))",
"insert into Rating values(202, 106, 4, null)",
"insert into Rating values(203, 103, 2, TO_DATE('2011-01-20', 'YYYY-MM-DD'))",
"insert into Rating values(203, 108, 4, TO_DATE('2011-01-12', 'YYYY-MM-DD'))",
"insert into Rating values(203, 108, 2, TO_DATE('2011-01-30', 'YYYY-MM-DD'))",
"insert into Rating values(204, 101, 3, TO_DATE('2011-01-09', 'YYYY-MM-DD'))",
"insert into Rating values(205, 103, 3, TO_DATE('2011-01-27', 'YYYY-MM-DD'))",
"insert into Rating values(205, 104, 2, TO_DATE('2011-01-22', 'YYYY-MM-DD'))",
"insert into Rating values(205, 108, 4, null)",
"insert into Rating values(206, 107, 3, TO_DATE('2011-01-15', 'YYYY-MM-DD'))",
"insert into Rating values(206, 106, 5, TO_DATE('2011-01-19', 'YYYY-MM-DD'))",
"insert into Rating values(207, 107, 5, TO_DATE('2011-01-22', 'YYYY-MM-DD'))",
"insert into Rating values(208, 104, 3, TO_DATE('2011-01-02', 'YYYY-MM-DD'))",
]
for i in query:
    sql_update(i)

Find the titles of all movies directed by Steven Spielberg.

In [ ]:
query = """ select * from Movie where director='Steven Spielberg' """
df = pd.read_sql(query, con=config.connection)
df

Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order

In [ ]:
query = """ select * from Rating where stars between 4 and 5 and ratingdate is not null ORDER BY ratingdate"""
df = pd.read_sql(query, con=config.connection)
df

Find the titles of all movies that have no ratings

In [ ]:
query = """ select title from Movie where mID in (select mID from Movie where mID not in (select mID from Rating))"""
df = pd.read_sql(query, con=config.connection)
df

Some reviewers didn't provide a date with their rating. Find the names of all reviewers who have ratings with a NULL value for the date

In [ ]:
query = """ select name from Reviewer where rID in (select rID from Rating where ratingDate is null)"""
df = pd.read_sql(query, con=config.connection)
df

In [ ]:
sql_reader = pd.read_sql(qry, con=config.connection, chunksize=10**4)

for df in sql_reader:
    print (df)